// LG 메인페이지 JS - main.js //

$(function () { ///////// jQB ////////////////////////////

    ///////////////////////////////////////////////////////
    /////// 1. 상단영역 ////////////////////////////////////
    ///////////////////////////////////////////////////////
    let gnbli = $("#gnb>li");

    /*  메뉴슬라이드 뒷판 내려오기 ************************ */
    gnbli.hover(
        function () { //// over
            $(".top").addClass("on");
        },
        function () { //// out
            $(".top").removeClass("on");
        }); ///// hover //////////////

    /* 메뉴슬라이드 내려오기 ****************************** */
    gnbli.hover(
        function () { //// over
            $(this).addClass("on");
        },
        function () { //// out
            $(this).removeClass("on");
        }); ///// hover //////////////

    ////////////////////////////////////////////////////////
    ////////////////////////////////////////////////////////

    ////////////////////////////////////////////////////////
    /////// 2. 배너영역 ////////////////////////////////////
    ////////////////////////////////////////////////////////

    /* 배너 이미지 변경하기 ****************************** */
   // 인터발함수(지우기위해 만든변수)
    let autoB;
    /*////////////////////////////////////////////
        함수명: autoSlide
        기능: 자동넘기기 셋팅함수(인터발함수)
    */ ////////////////////////////////////////////
    
//    let banner = $(".banner");
    let banner = $(".slide");

    // 이미지순번
//    let bnum = 0;
    // 선택된 순번의 li의 배경을 순번대로 넣기
    // 변경대상: .banner 의 배경

    //배너 순번증가
//    bnum++; //1씩증가
//    if (bnum === 4) bnum = 0; //한계값

    // 순번과 매칭된 이미지를 배경이미지로 넣기
//    banner.eq(bnum)
//        .css({
//            opacity: 1
//        })
//        .animate({
//            background: "url(../images/main_0" + bnum + ".png) no-repeat center"
//        }, 4000); /////////////////////////////animate ////////

let autoSlide = function () {
        autoB = setInterval(function () {

            banner.animate({
                opacity:1
            }, 400, "easeOutCubic",
            function () { //애니후
                // 맨앞li 맨뒤로 보내기
                $(this).append(banner.find("li").first())
                    .css({
                    transition: "opacity 4s",
                        opacity:0
                    });

            }); /// animate /////

        }, 4000); // 배너시간4초
        
    }; ////// autoSlide함수 //////////////////////
    //////////////////////////////////////////////

    // 할당형함수 아래에서 처음 호출해야함!
    autoSlide(); //최초호출!


}); ///////// jQB ////////////////////////////////
